In [1]:
import mysql.connector

In [3]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="habibi$123"
)

if mydb.is_connected():
    print('Connection Successful')
else:
    print("Connection Failure")

Connection Successful

In [ ]:
# Creating a database 
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'habibi$123'
)

mycursor = mydb.cursor()
mycursor.execute('CREATE DATABASE db1')

In [10]:
# To show the created/ available databases
mycursor.execute('SHOW DATABASES')
for db in mycursor:
    print(db)

('db1',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

In [11]:
# Connecting to the required dataase
database = 'db1'
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'habibi$123',
    database = database
)
if mydb.is_connected():
    print(f"Database {database} connection succesful.")
else:
    print(f"Database {database} couldn't be connected.")

Database db1 connection succesful.

In [2]:
# Creating table in the database
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'habibi$123',
    database = 'db1'
)

mycursor = mydb.cursor()

mycursor.execute('CREATE TABLE customers (name VARCHAR(30), address VARCHAR(30))')

mycursor.close()
mydb.close()

In [6]:
# To list down all the tables in a database
import mysql.connector

mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'habibi$123',
    database = 'db1'
)

mycursor = mydb.cursor()
mycursor.execute('SHOW TABLES')
for table in mycursor:
    print(table)
mycursor.close()
mydb.close()

('customers',)

# Primary Key
A primary key in a database is a unique identifier for each record (row) in a table.  
It ensures that:  
1. No two rows have the same key value (uniqueness).
2. The key value is never NULL (not empty).

In [ ]:
# adding a primary key in the existing table 
#since we have already created table we use the alter command instead of create

import mysql.connector

mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'habibi$123',
    database = 'db1'
)

mycursor = mydb.cursor()
mycursor.execute('ALTER TABLE customers ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY')
mycursor.execute('SHOW COLUMNS FROM customers')

#mycursor.execute('DESCRIBE customers')

for column in mycursor:
    print(column)

mycursor.close()
mydb.close()

('name', 'varchar(30)', 'YES', '', None, '')
('address', 'varchar(30)', 'YES', '', None, '')
('id', 'int', 'NO', 'PRI', None, 'auto_increment')

In [ ]:
#adding a column in table
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'habibi$123',
    database = 'db1'
)

mycursor = mydb.cursor()
mycursor.execute('ALTER TABLE customers ADD COLUMN demo_col VARCHAR(255)')
mycursor.execute('DESCRIBE customers')
for column in mycursor:
    print(column)

('name', 'varchar(30)', 'YES', '', None, '')
('address', 'varchar(30)', 'YES', '', None, '')
('id', 'int', 'NO', 'PRI', None, 'auto_increment')
('demo_col', 'varchar(255)', 'YES', '', None, '')

In [5]:
#deleting a column in a table
mycursor.execute('ALTER TABLE customers DROP COLUMN demo_col')
mycursor.execute('DESCRIBE customers')
for column in mycursor:
    print(column)

('name', 'varchar(30)', 'YES', '', None, '')
('address', 'varchar(30)', 'YES', '', None, '')
('id', 'int', 'NO', 'PRI', None, 'auto_increment')

In [6]:
#renaming a column
mycursor.execute('ALTER TABLE customers RENAME COLUMN name TO customer_name')
mycursor.execute('DESCRIBE customers')
for column in mycursor:
    print(column)

('customer_name', 'varchar(30)', 'YES', '', None, '')
('address', 'varchar(30)', 'YES', '', None, '')
('id', 'int', 'NO', 'PRI', None, 'auto_increment')

In [ ]:
# changing column datatype in a database
mycursor.execute('ALTER TABLE customers MODIFY COLUMN customer_name VARCHAR(255)')
mycursor.execute('DESCRIBE customers')
for column in mycursor:
    print(column)

('customer_name', 'varchar(255)', 'YES', '', None, '')
('address', 'varchar(30)', 'YES', '', None, '')
('id', 'int', 'NO', 'PRI', None, 'auto_increment')

In [ ]:
# raenaming a table
mycursor.execute('ALTER TABLE customers RENAME TO customers_info')
mycursor.execute('DESCRIBE customers_info')
for column in mycursor:
    print(column)

('customer_name', 'varchar(255)', 'YES', '', None, '')
('address', 'varchar(30)', 'YES', '', None, '')
('id', 'int', 'NO', 'PRI', None, 'auto_increment')

In [ ]:
#dropping a primary key
mycursor.execute('ALTER TABLE customers_info MODIFY COLUMN id INT ') #REMOVING AUTO-INCREMENT
mycursor.execute('ALTER TABLE customers_info DROP PRIMARY KEY')
mycursor.execute('DESCRIBE customers_info')
for column in mycursor:
    print(column)

('customer_name', 'varchar(255)', 'NO', '', None, '')
('address', 'varchar(30)', 'YES', '', None, '')
('id', 'int', 'NO', '', None, '')

In [22]:
# adding a primary key 

mycursor.execute('ALTER TABLE customers_info ADD PRIMARY KEY (id)')
mycursor.execute('DESCRIBE customers_info')
for column in mycursor:
    print(column)

('customer_name', 'varchar(255)', 'NO', '', None, '')
('address', 'varchar(30)', 'YES', '', None, '')
('id', 'int', 'NO', 'PRI', None, '')

In [23]:
#adding constraints not-null
mycursor.execute('ALTER TABLE customers_info MODIFY customer_name VARCHAR(255) NOT NULL')

In [24]:
mycursor.close()
mydb.close()

In [1]:
#inserting values in databse
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'habibi$123',
    database = 'db1'
)

mycursor = mydb.cursor()
mycursor.execute('SHOW TABLES')
for table in mycursor:
    print(table)

('customers_info',)

In [2]:
mycursor.execute('DESCRIBE customers_info')
for column in mycursor:
    print(column)

('customer_name', 'varchar(255)', 'NO', '', None, '')
('address', 'varchar(30)', 'YES', '', None, '')
('id', 'int', 'NO', 'PRI', None, '')

In [5]:
mycursor.execute('ALTER TABLE customers_info MODIFY COLUMN id INT AUTO_INCREMENT')

In [6]:
sql = 'INSERT INTO customers_info (customer_name,address) VALUES (%s,%s)'
val = ('John','Highway 21')
mycursor.execute(sql,val)
mydb.commit() #this statement is required to make changes to the table

In [ ]:
print(mycursor.rowcount,'record inserted') #this statement is used to get no of rows inserted recently

1 record inserted

In [ ]:
#inserting multiple records in a table
sql = 'INSERT INTO customers_info (customer_name,address) VALUES (%s,%s)'
val = [('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')]
mycursor.executemany(sql,val)   # to insert multiple record we use mycursor.executemany()
mydb.commit()
print(mycursor.rowcount,'record inserted')

13 record inserted

In [ ]:
print('ID of the last row inserted', mycursor.lastrowid)  #it gives auto-incremented id of last row inserted

ID of the last row inserted 2

In [13]:
sql = 'INSERT INTO customers_info (customer_name,address) VALUES (%s,%s)'
val = ('Manu',' ***** ')
mycursor.execute(sql,val)
mydb.commit()

print('ID of last row inserted: ',mycursor.lastrowid)

ID of last row inserted:  15

In [ ]:
#selecting records from table
mycursor.execute('SELECT * FROM customers_info')   #selecting all data from table
records = mycursor.fetchall()
for record in records:
    print(record)

('John', 'Highway 21', 1)
('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Ben', 'Park Lane 38', 11)
('William', 'Central st 954', 12)
('Chuck', 'Main Road 989', 13)
('Viola', 'Sideway 1633', 14)
('Manu', ' ***** ', 15)

In [ ]:
mycursor.execute('SELECT customer_name,address FROM customers_info')  #selecting specific column for all record in table
records = mycursor.fetchall()
for record in records:
    print(record)

('John', 'Highway 21')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')
('Manu', ' ***** ')

In [20]:
#selecting the first record of the table using fetchone() method
mycursor.execute('SELECT * FROM customers_info')
record = mycursor.fetchone()
print(record)

('John', 'Highway 21', 1)

In [5]:
# selecting with filter 
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'habibi$123',
    database = 'db1'
)
mycursor = mydb.cursor()
sql = 'SELECT * FROM customers_info WHERE address = "Park Lane 38"'
mycursor.execute(sql)

records = mycursor.fetchall()
for record in records:
    print(record)

('Ben', 'Park Lane 38', 11)

# Wildcard Characters
In SQL, wildcard characters are mainly used with the LIKE operator to perform pattern matching in queries — that is, to search for data that matches a specific format rather than an exact value.  

![SQL Wildcards](images/Screenshot%202025-10-08%20at%2008.52.15.png)

In [6]:
# 1. Names starting with “S”
sql = 'SELECT * FROM customers_info WHERE customer_name LIKE "S%"'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

('Sandy', 'Ocean blvd 2', 6)
('Susan', 'One way 98', 9)

In [7]:
# 2. Names ending with “n”
sql = 'SELECT * FROM customers_info WHERE customer_name LIKE "%n"'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

('John', 'Highway 21', 1)
('Susan', 'One way 98', 9)
('Ben', 'Park Lane 38', 11)

In [8]:
# 3. Names having “an” anywhere
sql = 'SELECT * FROM customers_info WHERE customer_name LIKE "%an%"'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

('Hannah', 'Mountain 21', 4)
('Sandy', 'Ocean blvd 2', 6)
('Susan', 'One way 98', 9)
('Manu', ' ***** ', 15)

In [9]:
# 4. Names with exactly 4 letters
sql = 'SELECT * FROM customers_info WHERE customer_name LIKE "____"'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

('John', 'Highway 21', 1)
('Manu', ' ***** ', 15)

In [12]:
sql = 'SELECT * FROM customers_info'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

('John', 'Highway 21', 1)
('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Ben', 'Park Lane 38', 11)
('William', 'Central st 954', 12)
('Chuck', 'Main Road 989', 13)
('Viola', 'Sideway 1633', 14)
('Manu', ' ***** ', 15)

In [13]:
# 5. Names starting with A or B (SQL Server syntax)
sql = 'SELECT * FROM customers_info WHERE customer_name REGEXP "^[AB]"'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

('Amy', 'Apple st 652', 3)
('Betty', 'Green Grass 1', 7)
('Ben', 'Park Lane 38', 11)

# Preventing SQL Injection
When query values are provided by the user, we should escape the values.  
This is to prevent SQL injections, which is a common web hacking technique to destroy or misuse the database.  
The mysql.connector module has methods to escape query values using wildcard characters.

In [16]:
sql = 'SELECT * FROM customers_info WHERE address= %s'
address = ('Green Grass 1',)
mycursor.execute(sql,address)
records = mycursor.fetchall()
for record in records:
    print(record)

('Betty', 'Green Grass 1', 7)

In [ ]:
# selecting records in order (ascending)
sql = 'SELECT * FROM customers_info ORDER BY customer_name'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

('Amy', 'Apple st 652', 3)
('Ben', 'Park Lane 38', 11)
('Betty', 'Green Grass 1', 7)
('Chuck', 'Main Road 989', 13)
('Hannah', 'Mountain 21', 4)
('John', 'Highway 21', 1)
('Manu', ' ***** ', 15)
('Michael', 'Valley 345', 5)
('Peter', 'Lowstreet 4', 2)
('Richard', 'Sky st 331', 8)
('Sandy', 'Ocean blvd 2', 6)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Viola', 'Sideway 1633', 14)
('William', 'Central st 954', 12)

In [18]:
# selecting records in order (descending)
sql = 'SELECT * FROM customers_info ORDER BY customer_name DESC'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

('William', 'Central st 954', 12)
('Viola', 'Sideway 1633', 14)
('Vicky', 'Yellow Garden 2', 10)
('Susan', 'One way 98', 9)
('Sandy', 'Ocean blvd 2', 6)
('Richard', 'Sky st 331', 8)
('Peter', 'Lowstreet 4', 2)
('Michael', 'Valley 345', 5)
('Manu', ' ***** ', 15)
('John', 'Highway 21', 1)
('Hannah', 'Mountain 21', 4)
('Chuck', 'Main Road 989', 13)
('Betty', 'Green Grass 1', 7)
('Ben', 'Park Lane 38', 11)
('Amy', 'Apple st 652', 3)

In [ ]:
# deleting records from table
sql = 'DELETE FROM customers_info WHERE customer_name LIKE "%tt%"'
mycursor.execute(sql)
mydb.commit()  #to make any change sto the table we use this statement
print('Deleted Records:')
print(mycursor.rowcount,'record(s) deleted')

Deleted Records:
1 record(s) deleted

In [24]:
# preventing sql injection 
sql = 'DELETE FROM customers_info WHERE customer_name = %s'
cus_name = ('John',)
mycursor.execute(sql,cus_name)
mydb.commit()  #to make any change sto the table we use this statement
print(mycursor.rowcount,'record(s) deleted')

1 record(s) deleted

In [25]:
# Truncating the entire table (deleting the data of the table but no deletion of table)

sql = 'TRUNCATE TABLE customers_info'
mycursor.execute(sql)
print('Table customers_info truncated successfully')

Table customers_info truncated successfully

In [26]:
sql = 'SELECT * FROM customers_info'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

In [27]:
sql = 'SHOW TABLES'
mycursor.execute(sql)
tables = mycursor.fetchall()
for table in tables:
    print(table)

('customers_info',)

In [28]:
# dropping a table
sql = 'DROP TABLE customers_info'
mycursor.execute(sql)
print("Table customers_info deleted successfully")

Table customers_info deleted successfully

In [29]:
sql = 'SHOW TABLES'
mycursor.execute(sql)
tables = mycursor.fetchall()
for table in tables:
    print(table)

In [10]:
# dropping table if exists
sql = 'DROP TABLE IF EXISTS students'
mycursor.execute(sql)

# IS EXISTS only work with DROP

In [11]:
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'habibi$123',
    database = 'db1'
)

mycursor = mydb.cursor()
sql = 'CREATE TABLE students (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(30), address VARCHAR(30))'
mycursor.execute(sql)

In [12]:
sql = 'INSERT INTO students (name,address) VALUES (%s,%s)'
val = ('Manu', '****')
mycursor.execute(sql,val)
mydb.commit()

In [13]:
sql = 'INSERT INTO students (name,address) VALUES (%s,%s)'
val = [('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')]
mycursor.executemany(sql,val)
mydb.commit()

In [14]:
sql = 'SELECT * FROM students'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

(1, 'Manu', '****')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')
(6, 'Sandy', 'Ocean blvd 2')
(7, 'Betty', 'Green Grass 1')
(8, 'Richard', 'Sky st 331')
(9, 'Susan', 'One way 98')
(10, 'Vicky', 'Yellow Garden 2')
(11, 'Ben', 'Park Lane 38')
(12, 'William', 'Central st 954')
(13, 'Chuck', 'Main Road 989')
(14, 'Viola', 'Sideway 1633')

In [15]:
# updating the records
sql = 'UPDATE students SET address = "Black Villa" WHERE name ="Manu"'
mycursor.execute(sql)
mydb.commit()

In [16]:
sql = 'SELECT * FROM students'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

(1, 'Manu', 'Black Villa')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')
(6, 'Sandy', 'Ocean blvd 2')
(7, 'Betty', 'Green Grass 1')
(8, 'Richard', 'Sky st 331')
(9, 'Susan', 'One way 98')
(10, 'Vicky', 'Yellow Garden 2')
(11, 'Ben', 'Park Lane 38')
(12, 'William', 'Central st 954')
(13, 'Chuck', 'Main Road 989')
(14, 'Viola', 'Sideway 1633')

In [17]:
sql = 'UPDATE students SET address = %s WHERE address = %s'
val = ("Valley 345", "Canyon 123")
mycursor.execute(sql,val)
mydb.commit()

In [18]:
# limiting the no.of records fetched
sql = 'SELECT * FROM students LIMIT 5'
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

(1, 'Manu', 'Black Villa')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')

In [21]:
# using offset to define the stating record
sql = 'SELECT * FROM students LIMIT 5 OFFSET 2'  # OFFSET can only be used if LIMIT is used 
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')
(6, 'Sandy', 'Ocean blvd 2')
(7, 'Betty', 'Green Grass 1')

In [ ]:
sql = '''CREATE TABLE users(
id INT PRIMARY KEY,
name VARCHAR(30),
fav INT NULL)'''
mycursor.execute(sql)
sql = 'INSERT INTO users (id,name,fav) VALUES (%s,%s,%s)'
val = [
    (1, 'John', 154),
    (2, 'Peter', 154),
    (3, 'Amy', 155),
    (4, 'Hannah', None),
    (5, 'Michael', None)
]
mycursor.executemany(sql,val)

In [25]:
sql = '''CREATE TABLE products(
id INT PRIMARY KEY,
name VARCHAR(40)
)'''
mycursor.execute(sql)
sql ='INSERT INTO products (id,name) VALUES (%s,%s)'
val = [
    (154, 'Chocolate Heaven'),
    (155, 'Tasty Lemons'),
    (156, 'Vanilla Dreams')
]
mycursor.executemany(sql,val)

In [27]:
# joining two tables data 
sql = '''SELECT
users.name AS user_name,
products.name as product_name
FROM users
INNER JOIN products ON users.fav = products.id 
'''
mycursor.execute(sql)
records = mycursor.fetchall()
for record in records:
    print(record)

('John', 'Chocolate Heaven')
('Peter', 'Chocolate Heaven')
('Amy', 'Tasty Lemons')

In [28]:
# the above code doesn't create a new_table but instead is only read-dispaly operation to actually create table we run the below code
from tabulate import tabulate
sql = '''CREATE TABLE user_favourite_product AS
SELECT 
users.name AS user_name,
products.name AS products_name
FROM users
INNER JOIN products ON users.fav = products.id
'''
mycursor.execute(sql)
sql1 = 'SELECT * FROM user_favourite_product'
mycursor.execute(sql1)
records = mycursor.fetchall()
columns = mycursor.column_names
print(tabulate(records,headers=columns,tablefmt='fancy_grid'))

╒═════════════╤══════════════════╕
│ user_name   │ products_name    │
╞═════════════╪══════════════════╡
│ John        │ Chocolate Heaven │
├─────────────┼──────────────────┤
│ Peter       │ Chocolate Heaven │
├─────────────┼──────────────────┤
│ Amy         │ Tasty Lemons     │
╘═════════════╧══════════════════╛

# Left Join
In the example above, Hannah, and Michael were excluded from the result, that is because INNER JOIN only shows the records where there is a match.  
If we want to show all users, even if they do not have a favorite product, we use the LEFT JOIN statement:

In [31]:
sql = '''SELECT 
users.name AS user_name,
products.name AS product_name
FROM users
LEFT JOIN products ON users.fav = products.id'''
mycursor.execute(sql)
columns = mycursor.column_names
records = mycursor.fetchall()
print(tabulate(records,headers=columns))

user_name    product_name
-----------  ----------------
John         Chocolate Heaven
Peter        Chocolate Heaven
Amy          Tasty Lemons
Hannah
Michael

# Right Join
If we want to return all products, and the users who have them as their favorite, even if no user have them as their favorite, we use the RIGHT JOIN statement:

In [32]:
sql = '''SELECT
users.name AS user_name,
products.name AS product_name
FROM users
RIGHT JOIN products ON users.fav = products.id'''
mycursor.execute(sql)
columns = mycursor.column_names
records = mycursor.fetchall()
print(tabulate(records,headers=columns,tablefmt='fancy_grid'))

╒═════════════╤══════════════════╕
│ user_name   │ product_name     │
╞═════════════╪══════════════════╡
│ Peter       │ Chocolate Heaven │
├─────────────┼──────────────────┤
│ John        │ Chocolate Heaven │
├─────────────┼──────────────────┤
│ Amy         │ Tasty Lemons     │
├─────────────┼──────────────────┤
│             │ Vanilla Dreams   │
╘═════════════╧══════════════════╛